# -----------------------------------------------------------------------------------------------------------------------------
# 現在のURLから現在のページ数を取得
# -----------------------------------------------------------------------------------------------------------------------------
fetch_current_page = (url, param_name = "page") ->
  page = parseInt($.url(url).param(param_name))
  if isNaN(page)
    page = 1
  else
    page

# -----------------------------------------------------------------------------------------------------------------------------
# ブラウザの履歴(記憶している1つ前のURL)を現在のURLで置き換え
# -----------------------------------------------------------------------------------------------------------------------------
replace_history = (url) ->
  state = { url: url }
  history.replaceState(state, null, url)

# -----------------------------------------------------------------------------------------------------------------------------
# ブラウザのURLを次ページのURLにする
# -----------------------------------------------------------------------------------------------------------------------------
push_history = (url) ->
  state = { url: url }
  history.pushState(state, null, url)
  
# -----------------------------------------------------------------------------------------------------------------------------
# ブラウザバックした時に履歴のURLで再読込する
# -----------------------------------------------------------------------------------------------------------------------------
load_history = ->
  history_url = event.originalEvent.state.url
  window.location.href = history_url

# -----------------------------------------------------------------------------------------------------------------------------
# ページを読み込む
# -----------------------------------------------------------------------------------------------------------------------------
load_page = (url, method = "GET", dataType = "script") ->
  ajax = $.ajax({ url: url, data: method, dataType: dataType })
  ajax.done (data, status, xhr) ->
    if status == "success" # ステータスコードをチェックする場合は、xhr.status == 200
      push_history(url)

# -----------------------------------------------------------------------------------------------------------------------------
# 無限スクロールメイン
# -----------------------------------------------------------------------------------------------------------------------------
$(document).on "turbolinks:load", ->
  $(".users").on "scroll", (event) ->
    cur_url = location.pathname + location.search

    if cmn_scroll_top(event.target)
      replace_history(cur_url)

      cur_page  = fetch_current_page(cur_url)
      next_page = cur_page + 1

      next_url  = "/users/index?page=" + next_page
      load_page(next_url)

  $(window).on "popstate", (event) ->
    load_history()
